Config/Reports/КнигаПродаж735.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>КнигаПродаж735</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидимостьНастроек</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РежимРасшифровки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФормироватьДопЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СписокСформированныхЛистов</Name>
					<Type>
						<v8:Type>v8:ValueListType</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьТолькоДопЛисты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДополнительныеЛистыЗаТекущийПериод</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГруппироватьПоКонтрагентам</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВыводитьПредставленияПричинНалогообложения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РазделыДекларации</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПредставленияПричинНалогообложения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ПричинаНалогообложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ПричиныНалогообложенияНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Представление</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Config/Reports/КнигаПродаж735/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаКлиенте
Перем ОтключитьВыводЛистаПриВыбореСтрокиВДереве;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Инициализация:
	РегламентированныеРегистры.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	
	НастроитьФормуСервер_ОтчетПокаНеСформирован();
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СвязьПолейШапкиИОтбора_ПриСозданииНаСервере();
	//---
	
	УчетНДС.ЗаполнитьСписокПостановленийИзменяющихЗаполнениеКниг(
		Элементы["РедакцияПостановления"].СписокВыбора,
		РедакцияПостановления,
		"КнигаПродаж");
		
	УстановитьУсловноеОформление();
	
	Элементы.ОтборПравоеЗначение.УстановитьДействие("ИзменениеТекстаРедактирования", "Подключаемый_ОтборПравоеЗначениеИзменениеТекстаРедактирования");

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОтключитьВыводЛистаПриВыбореСтрокиВДереве = Истина;
	
	ТрансформироватьРеквизитыОтчетаВРеквизитыФормы();
	
	НастроитьФормуКлиент_ОбновитьЗаголовокФормы();
	
	НастроитьФормуКлиент_ДоступностьПараметровФормированияДопЛистов();
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	//---
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	ВариантМодифицирован = Ложь;
	
	ПользовательскиеНастройкиМодифицированы = Истина;
	
КонецПроцедуры

&НаСервере
Процедура ПриСохраненииПользовательскихНастроекНаСервере(Настройки)
	
	РегламентированныеРегистры.ПриСохраненииПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ПриЗагрузкеПользовательскихНастроекНаСервере(Настройки)
	
	РегламентированныеРегистры.ПриЗагрузкеПользовательскихНастроекНаСервере(ЭтаФорма, Настройки);
	
	// Пользовательские настройки в этом отчете не используем:
	НастройкиКомпоновщика = Отчет.КомпоновщикНастроек.Настройки;
	НастройкиКомпоновщика.Отбор.ИдентификаторПользовательскойНастройки				= "";
	НастройкиКомпоновщика.Порядок.ИдентификаторПользовательскойНастройки			= "";
	НастройкиКомпоновщика.УсловноеОформление.ИдентификаторПользовательскойНастройки	= "";
	
	НастроитьФормуСервер_ВидимостьПанелиНастройки();
	НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды();
	НастроитьФормуСервер_ДоступностьТаблицыПредставленияПричинНалогообложения();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
	//---
	// Механизм связи полей шапки и отбора
	//---
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	//---
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура НачалоПериодаПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
	УстановитьПостановлениеНаДату();
	
КонецПроцедуры
&НаКлиенте
Процедура КонецПериодаПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
	УстановитьПостановлениеНаДату();
	
КонецПроцедуры

&НаКлиенте
Процедура ФормироватьОсновныеРазделыПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииФлажкаРазделыКниги(1);
	
КонецПроцедуры
&НаКлиенте
Процедура ФормироватьДопЛистыПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииФлажкаРазделыКниги(2);
	
КонецПроцедуры
&НаКлиенте
Процедура РежимОтчетаДопЛистыПриИзменении(Элемент)
	
	ТрансформироватьРеквизитыФормыВРеквизитыОтчета();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ГруппироватьПоКонтрагентамПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыводитьПредставленияПричинНалогообложенияПриИзменении(Элемент)
	
	НастроитьФормуСервер_ДоступностьТаблицыПредставленияПричинНалогообложения();
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура РазделыДекларацииПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтчетТабличныйДокументПриАктивизацииОбласти(Элемент)
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	
	ПодключитьОбработчикОжидания("Подключаемый_РассчитатьСуммуЯчеек", ИнтервалОжидания, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПриИзменении(Элемент)
	
	НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	
КонецПроцедуры

&НаКлиенте
Процедура ПредставленияПричинНалогообложенияПриИзменении(Элемент)
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_ДеревоСформированныхЛистов

&НаКлиенте
Процедура ДеревоСформированныхЛистовПриАктивизацииСтроки(Элемент)
	
	Если ОтключитьВыводЛистаПриВыбореСтрокиВДереве = Истина Тогда
		ОтключитьВыводЛистаПриВыбореСтрокиВДереве = Ложь;
		Возврат;
	КонецЕсли;
	
	ИнтервалОжидания = ?(ПолучитьСкоростьКлиентскогоСоединения() = СкоростьКлиентскогоСоединения.Низкая, 1, 0.2);
	
	ПодключитьОбработчикОжидания("Подключаемый_ДеревоСформированныхЛистовПриАктивизацииСтроки", ИнтервалОжидания, Истина);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура УстановитьПериод(Команда)
	
	СтруктураПараметров = Новый Структура();
	СтруктураПараметров.Вставить("НачалоПериода",	Отчет["НачалоПериода"]);
	СтруктураПараметров.Вставить("КонецПериода",	Отчет["КонецПериода"]);
	
	СтандартныеОтчетыКлиент.ВыборПериодаОтчета(СтруктураПараметров, ЭтаФорма);
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьПериод_Выбор(РезультатВыбора, ПараметрыОповещения) Экспорт
	
	Если ТипЗнч(РезультатВыбора) = Тип("Структура") Тогда
		Отчет["НачалоПериода"]	= РезультатВыбора["НачалоПериода"];
		Отчет["КонецПериода"]	= РезультатВыбора["КонецПериода"];
		
		НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
		
		УстановитьПостановлениеНаДату();
	КонецЕсли
	
КонецПроцедуры

&НаКлиенте
Процедура СформироватьОтчет(Команда)
	
	Перем ИдТекущейСтрокиДереваСформированныхЛистов;
	
	ОчиститьСообщения();
	
	ОтключитьВыводЛистаПриВыбореСтрокиВДереве = Истина;
	
	СформироватьОтчетСервер(ИдТекущейСтрокиДереваСформированныхЛистов);
	
	УстановитьТекущуюСтрокуВДеревеСформированныхЛистов(ИдТекущейСтрокиДереваСформированныхЛистов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельНастроек(Команда)
	
	Отчет["ВидимостьНастроек"] = НЕ Отчет["ВидимостьНастроек"];
	
	НастроитьФормуСервер_ВидимостьПанелиНастройки();
	
КонецПроцедуры

&НаКлиенте
Процедура НалоговыеПериоды(Команда)
	
	ВидимостьНалоговыеПериоды = НЕ ВидимостьНалоговыеПериоды;
	
	НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды();
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаРазвернутьВсе(Команда)
	
	НастроитьСостояниеВсехСтрокДереваКлиент(Истина); // НеобходимоРазвернутьВсе
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаСвернутьВсе(Команда)
	
	НастроитьСостояниеВсехСтрокДереваКлиент(Ложь); // НеобходимоРазвернутьВсе
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПредставленияПричинНалогообложения(Команда)
	
	СпроситьИЗаполнитьПредставленияПричинНалогообложенияКлиент();
	
КонецПроцедуры

// Скопировано из общей формы "ФормаОтчета"
&НаКлиенте
Процедура ВычислитьСумму(Команда)
	СуммаВыделенныхЯчеек = ВычислитьСуммуСервер(ОтчетТабличныйДокумент, ВыделенныеОбласти());
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере // вызывается из общего модуля
Процедура ОпределитьИменаСохраняемыхРеквизитов() Экспорт
	
	// Реквизиты отчета:
	ИменаСохраняемыхРеквизитовОтчета = "
		|Организация,
		|НачалоПериода,
		|КонецПериода,
		|ВидимостьНастроек,
		|ГруппироватьПоКонтрагентам,
		|ФормироватьДопЛисты,
		|ДополнительныеЛистыЗаТекущийПериод,
		|ВыводитьТолькоДопЛисты,
		|ВыводитьПредставленияПричинНалогообложения,
		|ПредставленияПричинНалогообложения";
	
	// Реквизиты формы:
	ИменаСохраняемыхРеквизитовФормы = "
		|ИФО,
		|Контрагент,
		|ВыводитьОтбор,
		|ВидимостьНалоговыеПериоды";
	
КонецПроцедуры
&НаСервере
Функция ПолучитьПараметрыОтчета()
	
	ПараметрыОтчета = Новый Структура();
	ПараметрыОтчета.Вставить("Организация",							Отчет["Организация"]);
	ПараметрыОтчета.Вставить("НачалоПериода",						Отчет["НачалоПериода"]);
	ПараметрыОтчета.Вставить("КонецПериода",						Отчет["КонецПериода"]);
	ПараметрыОтчета.Вставить("ФормироватьДопЛисты",					Отчет["ФормироватьДопЛисты"]);
	ПараметрыОтчета.Вставить("ДополнительныеЛистыЗаТекущийПериод",	Отчет["ДополнительныеЛистыЗаТекущийПериод"]);
	ПараметрыОтчета.Вставить("ГруппироватьПоКонтрагентам",			Отчет["ГруппироватьПоКонтрагентам"]);
	ПараметрыОтчета.Вставить("ВыводитьТолькоДопЛисты",				Отчет["ВыводитьТолькоДопЛисты"]);
	ПараметрыОтчета.Вставить("КомпоновщикНастроек",					Отчет["КомпоновщикНастроек"]);
	ПараметрыОтчета.Вставить("ИФО",									ЭтаФорма["ИФО"]);
	ПараметрыОтчета.Вставить("Контрагент",							ЭтаФорма["Контрагент"]);
	ПараметрыОтчета.Вставить("ВыводитьОтбор",						ЭтаФорма["ВыводитьОтбор"]);
	
	ПараметрыОтчета.Вставить("ВыводитьПредставленияПричинНалогообложения",	Отчет["ВыводитьПредставленияПричинНалогообложения"]);
	ПараметрыОтчета.Вставить("ПредставленияПричинНалогообложения",			Отчет["ПредставленияПричинНалогообложения"].Выгрузить());
	
	ПараметрыОтчета.Вставить("УникальныйИдентификаторФормы",		ЭтаФорма.УникальныйИдентификатор);
	ПараметрыОтчета.Вставить("Колонтитулы_НаименованиеОтчета",		РеквизитФормыВЗначение("Отчет").Метаданные().Синоним);
	ПараметрыОтчета.Вставить("Колонтитулы_ТекущийПользователь",		Строка(ПользователиКлиентСервер.АвторизованныйПользователь()));
	
	ПараметрыОтчета.Вставить("РедакцияПостановления",				ЭтаФорма["РедакцияПостановления"]);
	
	ПараметрыОтчета.Вставить("РазделыДекларации",					Отчет["РазделыДекларации"]);
	
	Возврат ПараметрыОтчета;
	
КонецФункции
&НаСервере
Процедура СформироватьОтчетСервер(ВозвратИдТекущейСтрокиДереваСформированныхЛистов) Экспорт
	
	Если ПроверитьЗаполнение() Тогда
		
		ПараметрыОтчета = ПолучитьПараметрыОтчета();
		
		Отчеты.КнигаПродаж735.СформироватьОтчет(ПараметрыОтчета, АдресХранилищаРезультатовОтчета);
		
		// Заполняем дерево сформированных листов и выводим первый табличный документ:
		ВозвратИдТекущейСтрокиДереваСформированныхЛистов = НастроитьФормуСервер_ЗаполнитьРезультатамиОтчета();
		
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма, Истина);
		
	КонецЕсли;
	
КонецПроцедуры

&НаСервере // вызывается из общего модуля
Процедура ЗаполнитьНастройкамиПоУмолчанию(ЗаполняемыеНастройки = Неопределено) Экспорт
	
	Если ЗаполняемыеНастройки = Неопределено Тогда
		// Задаем настройки по умолчанию при первом открытии отчета:
		Отчет["ФормироватьДопЛисты"]				= Истина;
		Отчет["ДополнительныеЛистыЗаТекущийПериод"]	= Истина;
		ВидимостьНалоговыеПериоды					= Истина;
		
	Иначе
		// Настраиваем отчет по переданным параметрам.
		// Устанавливаем реквизиты отчета:
		ВремСтруктура = Новый Структура(ИменаСохраняемыхРеквизитовОтчета);
		ЗаполнитьЗначенияСвойств(ВремСтруктура, ЗаполняемыеНастройки);
		ЗаполнитьЗначенияСвойств(Отчет, ВремСтруктура);
		
		// Устанавливаем реквизиты формы:
		ВремСтруктура = Новый Структура(ИменаСохраняемыхРеквизитовФормы);
		ЗаполнитьЗначенияСвойств(ВремСтруктура, ЗаполняемыеНастройки);
		ЗаполнитьЗначенияСвойств(ЭтаФорма, ВремСтруктура);
	КонецЕсли;
	
КонецПроцедуры
&НаСервере // вызывается из общего модуля
Процедура ИзменениеСхемыКомпоновкиДанных() Экспорт
	// (не используется, оставлена для совместимости с РегламентированныеРегистры.ПриСозданииНаСервере)
КонецПроцедуры

&НаКлиенте // вызывается в том числе механизмом связи полей шапки и отбора
Процедура НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(УстановитьСостояниеТабличногоДокумента = Истина) Экспорт
	
	НастроитьФормуКлиент_ОбновитьЗаголовокФормы();
	
	Если УстановитьСостояниеТабличногоДокумента Тогда
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	КонецЕсли;
	
	//---
	// Механизм автоматической установки флажка "Выводить отбор"
	//---
	Попытка
		АвтоматическаяУстановкаФлажкаВыводитьОтбор_ОбновитьСостояниеФлажка();
	Исключение
	КонецПопытки;
	//---
	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьФормуКлиент_ОбновитьЗаголовокФормы()
	
	ЗаголовокОтчета = НСтр("ru='Книга продаж'") + СтандартныеОтчетыКлиентСервер.ПолучитьПредставлениеПериода(
		Отчет["НачалоПериода"],
		Отчет["КонецПериода"]);

	Если ЗначениеЗаполнено(Отчет["Организация"]) Тогда
		ЗаголовокОтчета = ЗаголовокОтчета + " "
			+ СтандартныеОтчетыПовтИсп.ПолучитьТекстОрганизация(Отчет["Организация"], Ложь);
	КонецЕсли;
	
	ЭтаФорма.Заголовок = ЗаголовокОтчета;

КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ВидимостьПанелиНастройки()
	
	НовВидимость = Отчет["ВидимостьНастроек"];
	
	Элементы["ГруппаПанельНастроек"].Видимость	= НовВидимость;
	Элементы["ПанельНастроек"].Пометка			= НовВидимость;
	
КонецПРоцедуры
&НаСервере
Процедура НастроитьФормуСервер_ВидимостьПанелиНалоговыеПериоды()
	
	НовВидимость = ВидимостьНалоговыеПериоды;
	
	Элементы["ГруппаПанельНалоговыеПериоды"].Видимость	= НовВидимость;
	Элементы["НалоговыеПериоды"].Пометка				= НовВидимость;
	
КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ОтчетПокаНеСформирован()
	
	// Дерево результатов:
	ДеревоСформированныхЛистов.ПолучитьЭлементы().Очистить();
	СлужебнаяСтрока = ДеревоСформированныхЛистов.ПолучитьЭлементы().Добавить();
	СлужебнаяСтрока["Наименование"]						= НСтр("ru='отчет пока не сформирован'");
	СлужебнаяСтрока["Картинка"]							= БиблиотекаКартинок.Информация;
	СлужебнаяСтрока["ПредставлениеНалоговогоПериода"]	= НСтр("ru='данные отсутствуют'");
	
	ВыбранныйНалоговыйПериод = СлужебнаяСтрока["ПредставлениеНалоговогоПериода"];
	
КонецПроцедуры
&НаСервере
Функция НастроитьФормуСервер_ЗаполнитьРезультатамиОтчета()
	
	Перем ИдТекущейСтроки;
	
	РезультатыОтчета = ПолучитьИзВременногоХранилища(АдресХранилищаРезультатовОтчета);
	
	// Заполняем дерево листов:
	ДеревоЗначенийСформированныхЛистов = РеквизитФормыВЗначение("ДеревоСформированныхЛистов");
	ДеревоЗначенийСформированныхЛистов.Строки.Очистить();
	РегламентированныеРегистры.СкопироватьСтрокиДереваЗначений(ДеревоЗначенийСформированныхЛистов, РезультатыОтчета["ДеревоСформированныхЛистов"]);
	ЗначениеВРеквизитФормы(ДеревоЗначенийСформированныхЛистов, "ДеревоСформированныхЛистов");
	
	ВидСписка = (ДеревоЗначенийСформированныхЛистов.Строки.Количество() = 1
				И ДеревоЗначенийСформированныхЛистов.Строки[0]["ЭтоПустойЛист"]);
				
	Элементы["ДеревоСформированныхЛистов"].Отображение = ?(ВидСписка,
		ОтображениеТаблицы.Список,
		ОтображениеТаблицы.Дерево);
	
	// Показываем самый первый лист:
	Попытка
		ИдТекущейСтроки = ДеревоСформированныхЛистов.ПолучитьЭлементы()[0].ПолучитьИдентификатор();
	Исключение
	КонецПопытки;
	ПоказатьВыбранныйЛистСервер(ИдТекущейСтроки);
	
	Возврат ИдТекущейСтроки;
	
КонецФункции
&НаКлиенте
Процедура НастроитьФормуКлиент_ПриИзмененииФлажкаРазделыКниги(ОбозначениеРазделаКниги)
	
	СброшеныВсеФлажки = (НЕ ФормироватьОсновныеРазделы И НЕ ФормироватьДопЛисты);
	Если СброшеныВсеФлажки Тогда
		Если ОбозначениеРазделаКниги = 1 Тогда
			// Принудительно устанавливаем только что сброшенный флажок "Основной раздел":
			ФормироватьОсновныеРазделы	= Истина;
		ИначеЕсли ОбозначениеРазделаКниги = 2 Тогда
			// Принудительно устанавливаем только что сброшенный флажок "Дополнительные листы":
			ФормироватьДопЛисты			= Истина;
		КонецЕсли;
	Иначе
		СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	КонецЕсли;
	
	ТрансформироватьРеквизитыФормыВРеквизитыОтчета();
	
	НастроитьФормуКлиент_ДоступностьПараметровФормированияДопЛистов();
	
КонецПроцедуры
&НаКлиенте
Процедура НастроитьФормуКлиент_ДоступностьПараметровФормированияДопЛистов()
	Элементы["РежимОтчетаДопЛисты"].Доступность = ФормироватьДопЛисты;
КонецПроцедуры
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УчетНДС.УстановитьУсловноеОформлениеВКнигеПокупокИлиКнигеПродаж(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ТрансформироватьРеквизитыОтчетаВРеквизитыФормы()
	
	//РежимОтчетаДопЛисты =
	//0. Изменяющие указанный
	//1. Сформированные в указанном периоде
	
	ФормироватьДопЛисты			= Отчет["ФормироватьДопЛисты"];
	ФормироватьОсновныеРазделы	= НЕ (Отчет["ФормироватьДопЛисты"] И Отчет["ВыводитьТолькоДопЛисты"]);
	Если Отчет["ДополнительныеЛистыЗаТекущийПериод"] Тогда
		РежимОтчетаДопЛисты = 0;
	Иначе
		РежимОтчетаДопЛисты = 1;
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура ТрансформироватьРеквизитыФормыВРеквизитыОтчета()
	
	//РежимОтчетаДопЛисты =
	//0. Изменяющие указанный
	//1. Сформированные в указанном периоде
	
	Отчет["ФормироватьДопЛисты"]				= ФормироватьДопЛисты;
	Отчет["ВыводитьТолькоДопЛисты"]				= ФормироватьДопЛисты И НЕ ФормироватьОсновныеРазделы;
	Отчет["ДополнительныеЛистыЗаТекущийПериод"]	= (РежимОтчетаДопЛисты = 0);
	
КонецПроцедуры

&НаСервере
Процедура ПоказатьВыбранныйЛистСервер(ИдТекущейСтрокиДереваСформированныхЛистов)
	
	ОтчетТабличныйДокумент.Очистить();
	
	Попытка
		ТекДанные = ДеревоСформированныхЛистов.НайтиПоИдентификатору(ИдТекущейСтрокиДереваСформированныхЛистов);
		АдресХранилищаСДаннымиЛиста	= ТекДанные["АдресХранилищаСДаннымиЛиста"];
		ЭтоПустойЛист				= ТекДанные["ЭтоПустойЛист"];
		
		ДанныеЛиста = ПолучитьИзВременногоХранилища(АдресХранилищаСДаннымиЛиста);
		ТабличныйДокументЛиста = ДанныеЛиста["ТабличныйДокумент"];
		
		ОтчетТабличныйДокумент.Вывести(ТабличныйДокументЛиста);
		ЗаполнитьЗначенияСвойств(ОтчетТабличныйДокумент, ТабличныйДокументЛиста);
		
		ИмяНовойТекущейОбласти = Неопределено;
		Если ЭтоПустойЛист Тогда
			ИмяНовойТекущейОбласти = "R1C1";
		Иначе
			ВысотаТабДокумента = ТабличныйДокументЛиста.ВысотаТаблицы;
			НомерНижнейВыбраннойСтроки = Элементы["ОтчетТабличныйДокумент"].ТекущаяОбласть.Низ;
			Если НомерНижнейВыбраннойСтроки > ВысотаТабДокумента Тогда
				НомерВыбраннойСтроки = ВысотаТабДокумента - 10;
				Если НомерВыбраннойСтроки < 1 Тогда
					НомерВыбраннойСтроки = 1;
				КонецЕсли;
				ИмяНовойТекущейОбласти = "R" + Формат(НомерВыбраннойСтроки, "ЧГ=0") + "C1";
			КонецЕсли;
		КонецЕсли;
		Если ЗначениеЗаполнено(ИмяНовойТекущейОбласти) Тогда
			Элементы["ОтчетТабличныйДокумент"].ТекущаяОбласть = ОтчетТабличныйДокумент.Область(ИмяНовойТекущейОбласти);
		КонецЕсли;
		
		ВыбранныйНалоговыйПериод = ТекДанные["ПредставлениеНалоговогоПериода"];
	Исключение
	КонецПопытки;
	
КонецПроцедуры
&НаКлиенте
Процедура УстановитьТекущуюСтрокуВДеревеСформированныхЛистов(ИдТекущейСтрокиДереваСформированныхЛистов)
	
	ЭлементДерево = Элементы["ДеревоСформированныхЛистов"];
	
	// Раскрываем свернутые строки верхнего уровня дерева:
	ПерваяСтрокаСДанными = Неопределено;
	Для Каждого СтрокаВерхнегоУровня Из ДеревоСформированныхЛистов.ПолучитьЭлементы() Цикл
		Попытка
			ЭлементДерево.Развернуть(СтрокаВерхнегоУровня.ПолучитьИдентификатор());
		Исключение
		КонецПопытки;
	КонецЦикла;
	
	// Выбираем указанную строку:
	Если ЗначениеЗаполнено(ИдТекущейСтрокиДереваСформированныхЛистов) Тогда
		ЭлементДерево.ТекущаяСтрока = ИдТекущейСтрокиДереваСформированныхЛистов;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьСостояниеВсехСтрокДереваКлиент(НеобходимоРазвернутьВсе)
	
	// Входная проверка:
	Если НЕ НеобходимоРазвернутьВсе = Истина Тогда
		НеобходимоРазвернутьВсе = Ложь;
	КонецЕсли;
	
	ВсеСтрокиВерхнегоУровня = ДеревоСформированныхЛистов.ПолучитьЭлементы();
	ЭлементДерево = Элементы["ДеревоСформированныхЛистов"];
	Для Каждого СтрокаВерхнегоУровня Из ВсеСтрокиВерхнегоУровня Цикл
		Если НеобходимоРазвернутьВсе Тогда
			ЭлементДерево.Развернуть(СтрокаВерхнегоУровня.ПолучитьИдентификатор());
		Иначе
			ЭлементДерево.Свернуть(СтрокаВерхнегоУровня.ПолучитьИдентификатор());
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура СпроситьИЗаполнитьПредставленияПричинНалогообложенияКлиент()
	
	СледуетЗаполнитьПоУмолчанию = Истина;
	
	Если Отчет["ПредставленияПричинНалогообложения"].Количество() > 0 Тогда
		ТекстСообщения = НСтр("ru='Заполнить таблицу значениями по умолчанию?'");
		
		ОписаниеОповещенияВыбор = Новый ОписаниеОповещения("СпроситьИЗаполнитьПредставленияПричинНалогообложенияКлиент_Ответ", ЭтотОбъект);
		ПоказатьВопрос(ОписаниеОповещенияВыбор, ТекстСообщения, РежимДиалогаВопрос.ДаНет, 20, КодВозвратаДиалога.Да, , КодВозвратаДиалога.Нет);
	Иначе
		ЗаполнитьПредставленияПричинНалогообложенияСервер();
	КонецЕсли;
	
КонецПроцедуры
&НаКлиенте
Процедура СпроситьИЗаполнитьПредставленияПричинНалогообложенияКлиент_Ответ(РезультатВыбора, ОписаниеОповещения) Экспорт
	
	Если РезультатВыбора = КодВозвратаДиалога.Да Тогда
		
		ЗаполнитьПредставленияПричинНалогообложенияСервер();
		
	КонецЕсли;
	
КонецПроцедуры
&НаСервере
Процедура ЗаполнитьПредставленияПричинНалогообложенияСервер()
	
	УчетНДС.ЗаполнитьПредставленияПричинНалогообложения(Отчет["ПредставленияПричинНалогообложения"]);
	
	СтандартныеОтчетыКлиентСервер.УстановитьСостояние(ЭтаФорма);
	
КонецПроцедуры
&НаСервере
Процедура НастроитьФормуСервер_ДоступностьТаблицыПредставленияПричинНалогообложения()
	
	НовДоступность = Отчет["ВыводитьПредставленияПричинНалогообложения"];
	
	Элементы["ЗаполнитьПредставленияПричинНалогообложения"].Доступность	= НовДоступность;
	Элементы["ПредставленияПричинНалогообложения"].ТолькоПросмотр		= НЕ НовДоступность;
	
КонецПроцедуры

// Скопировано из общей формы "ФормаОтчета"
&НаКлиенте
Функция ВыделенныеОбласти()
	Результат = Новый Массив;
	Для Каждого ВыделеннаяОбласть Из ОтчетТабличныйДокумент.ВыделенныеОбласти Цикл
		Если ТипЗнч(ВыделеннаяОбласть) <> Тип("ОбластьЯчеекТабличногоДокумента") Тогда
			Продолжить;
		КонецЕсли;
		Структура = Новый Структура("Верх, Низ, Лево, Право, ТипОбласти");
		ЗаполнитьЗначенияСвойств(Структура, ВыделеннаяОбласть);
		Результат.Добавить(Структура);
	КонецЦикла;
	Возврат Результат;
КонецФункции
&НаКлиенте
Процедура Подключаемый_РассчитатьСуммуЯчеек()
	
	Сумма = СтандартныеОтчетыКлиентСервер.РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, Неопределено);
	Если ТипЗнч(Сумма) = Тип("Число") Тогда
		СуммаВыделенныхЯчеек = Формат(Сумма, "ЧН=0");
	Иначе
		СуммаВыделенныхЯчеек = "-";
	КонецЕсли;
	
КонецПроцедуры
&НаСервереБезКонтекста
Функция ВычислитьСуммуСервер(Знач ОтчетТабличныйДокумент, Знач ВыделенныеОбласти)
	Сумма = СтандартныеОтчетыКлиентСервер.РассчитатьСуммуВыделенныхЯчеек(ОтчетТабличныйДокумент, ВыделенныеОбласти);
	Возврат Формат(Сумма, "ЧН=0");
КонецФункции

&НаКлиенте
Процедура УстановитьПостановлениеНаДату()
	
	НаДату = ?(ЗначениеЗаполнено(Отчет.КонецПериода),
		Отчет.КонецПериода,
		Неопределено);
	
	РедакцияПостановления = ПолучитьПостановлениеНаДату(НаДату);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьПостановлениеНаДату(НаДату)
	
	Возврат УчетНДС.ПолучитьПостановлениеПоУмолчаниюДляЗаполненияКниги("КнигаПродаж", НаДату);
	
КонецФункции

//------------------------------------------------------------------------------
// Механизм автоматической установки флажка "Выводить отбор"

&НаКлиенте
Процедура АвтоматическаяУстановкаФлажкаВыводитьОтбор_ОбновитьСостояниеФлажка()
	
	РеквизитыШапки = Новый Структура("Организация", //ИФО, Контрагент",
		Отчет["Организация"]);//, ИФО, Контрагент);
	
	ВыводитьОтбор = СтандартныеОтчетыКлиентСервер.УстановленДополнительныйОтбор(Отчет.КомпоновщикНастроек.Настройки.Отбор, РеквизитыШапки);
	
КонецПроцедуры

// Механизм автоматической установки флажка "Выводить отбор"
//------------------------------------------------------------------------------

&НаКлиенте
Процедура Подключаемый_ОтборПравоеЗначениеИзменениеТекстаРедактирования(Текст, СтандартнаяОбработка)
	
	ТекДанные = Элементы.Отбор.ТекущиеДанные;
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекДанные.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("КодВидаОперации") И ТипЗнч(ТекДанные.ПравоеЗначение) = Тип("Строка")Тогда
		ВремСписок = Новый СписокЗначений();
		
		УчетНДСКлиентСервер.ЗаполнитьСписокКодовВидовОпераций(ВремСписок,, Отчет.КонецПериода);
		
		Оп = Новый ОписаниеОповещения("ВыбраноЗначениеКодВидаОперации", ЭтотОбъект, Элементы.Отбор.ТекущаяСтрока);
		
		ПоказатьВыборИзСписка(Оп, ВремСписок, Элементы.ОтборПравоеЗначение);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбраноЗначениеКодВидаОперации(ВыбранноеЗначение, ИдСтроки) Экспорт

	Если ВыбранноеЗначение = Неопределено Тогда
		Возврат;
	КонецЕсли;

	ТекДанные = Отчет.КомпоновщикНастроек.Настройки.Отбор.ПолучитьОбъектПоИдентификатору(ИдСтроки);
	
	Если ТекДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ТекДанные.ПравоеЗначение = ВыбранноеЗначение.Значение;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ДеревоСформированныхЛистовПриАктивизацииСтроки()
	
	ИдТекущейСтроки = Элементы["ДеревоСформированныхЛистов"].ТекущаяСтрока;
	
	ПоказатьВыбранныйЛистСервер(ИдТекущейСтроки);
	
КонецПроцедуры

#Область МеханизмСвязиПолейШапкиИОтбора

&НаСервере
Процедура СвязьПолейШапкиИОтбора_ПриСозданииНаСервере()
	
	МассивСтрокСвязи = Новый Массив();
	
	// Организация:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"Организация");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"Организация");
	СтрокаСвязи.Вставить("ШапкаИменаФункциональныхОпций",	"ИспользоватьНесколькоОрганизацийБГУ");
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	// ИФО:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"ИФО");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"ИФО");
	СтрокаСвязи.Вставить("ШапкаИменаФункциональныхОпций",	"ИспользоватьУчетПоИФО");
	СтрокаСвязи.Вставить("ВыводитьНадписьПомимоЗамка",		Ложь);
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	// Контрагент:
	СтрокаСвязи = Новый Структура();
	СтрокаСвязи.Вставить("РежимСвязи",						"ИндикаторСвязи");
	СтрокаСвязи.Вставить("ШапкаИмяЭлементаПоля",			"Контрагент");
	СтрокаСвязи.Вставить("ОтборИмяЭлементаТаблицы",			"Отбор");
	СтрокаСвязи.Вставить("ОтборИмяПоля",					"Контрагент");
	СтрокаСвязи.Вставить("ВыводитьНадписьПомимоЗамка",		Ложь);
	МассивСтрокСвязи.Добавить(СтрокаСвязи);
	
	СтандартныеОтчеты.СвязьПолейШапкиИОтбора_ПриСозданииНаСервере(ЭтаФорма,
		МассивСтрокСвязи,					// МассивСтрокСвязи
		ИменаСохраняемыхРеквизитовФормы,	// ИменаСохраняемыхРеквизитовФормы
		);									// ИменаСозданныхРеквизитовФормы
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьНеУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьНеУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_НажатиеКартинкиСвязьУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииПоляШапки(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы();
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаПоВсем(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаПоВсем(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьНеУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьНеУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьУстановлена(Элемент)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриИзмененииФлажкаСвязьУстановлена(ЭтаФорма, Отчет, Элемент);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриНачалеРедактированияСтрокиОтбора(Элемент, НоваяСтрока, Копирование)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриНачалеРедактированияСтрокиОтбора(ЭтаФорма, Отчет, Элемент, НоваяСтрока, Копирование);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОкончанииРедактированияСтрокиОтбора(ЭтаФорма, Отчет, Элемент, НоваяСтрока, ОтменаРедактирования);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора(Элемент)
	
	ПодключитьОбработчикОжидания("Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора_Служебный", 0.5, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_СвязьПолейШапкиИОтбора_ПослеУдаленияСтрокиОтбора_Служебный()
	
	СтандартныеОтчетыКлиентСервер.СвязьПолейШапкиИОтбора_ПриОткрытии(ЭтаФорма, Отчет);
	
	Попытка
		ЭтаФорма.НастроитьФормуКлиент_ПриИзмененииЭлементаФормы(Ложь);
	Исключение
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#КонецОбласти
